/*##########################################################################
# class키워드를 이용하여 Cart클래스를 정의 한다.
############################################################################*/
class Cart {
  /*##########################################################################
  # 클래스 바디에는 생성자 함수를 정의할 수 있다. constructor로 작성하고, 매개변수도
  # 정의 가능하다. 여기서는 아무런 매개변수를 정의하고 있지 않다. ES6이전의 생성자
  # 함수와 같은 역할을 하지만 function키워드가 없고, 이름이 constructor로 고정되어 있다고
  # 생각하면 된다.
  # 단 하나의 생성자 함수만 정의가 가능하다.
  # 생성자는 new키워드를 통해 객체가 생성 될때 호출된다. 여기서는 store속성에
  # 요약 : 생성자 함수는 매개변수에서 전달받은 값을 속성으로 추가 하거나, 속성의 초기값을 대입하는
  # 초기화 과정을 주로 한다.
  ############################################################################*/
  constructor() {
    this.store = {};
  }
  /*##########################################################################
  # addProduct 메소드를 정의 한다.
  # 메소드는 function키워드를 생략한다.
  # 매개변수로 product객체를 전달받아, product객체의 id값을 Key로 가지는 product객체를
  # store에 저장한다.
  ############################################################################*/
  addProduct(product) {
    this.store[product.id] = product;
  }

  /*##########################################################################
  # getProduct 메소드를 정의 한다.
  # 매개변수로 전달받은 id값을가지고 store객체에 key값으로 호출하여 결과를 반환한다.
  ############################################################################*/
  getProduct(id) {
    return this.store[id];
  }
}


/*##########################################################################
#Cart클래스의 cart1인스턴스를 생성한다.
#이때 constructor 생성자 함수가 호출되는 것이다.
############################################################################*/
const cart1 = new Cart();

/*##########################################################################
# cart1인스턴스로 addProduct메소드를 호출하고 product가될 argument를 정의 해준다.
############################################################################*/
cart1.addProduct({ id: 1, name: '노트북'})
console.log(cart1.store);


/*##########################################################################
# 변수 p에 cart1인스턴스로 getProduct메소드를 호출하고, argument로 id값을 던져
# 저장된 객체를 반환 받는다.
############################################################################*/
const p = cart1.getProduct(1);
console.log(p);





